{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "<h1>Security Assessment Report</h1>"
      },
      "name": "text - 0"
    },
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "crossComponentResources": [
          "{Subscriptions}"
        ],
        "parameters": [
          {
            "id": "f12c5d79-48c1-4adb-bad4-d4cc248f7fb9",
            "version": "KqlParameterItem/1.0",
            "name": "Subscriptions",
            "type": 6,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "summarize by subscriptionId\r\n| project value = strcat('/subscriptions/', subscriptionId), label = subscriptionId",
            "crossComponentResources": [
              "value::selected"
            ],
            "value": [
              "/subscriptions/2a165113-1848-4c2b-9e1d-16aa48ac9765"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ]
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "e04bd6ba-c1ad-466c-9835-c9f01dacdbe1",
            "version": "KqlParameterItem/1.0",
            "name": "LogsWorkspaces",
            "label": "Logs Workspaces",
            "type": 5,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "where type =~ 'microsoft.operationalinsights/workspaces'\r\n| summarize by id, name\r\n| project id",
            "crossComponentResources": [
              "{Subscriptions}"
            ],
            "value": [
              "/subscriptions/2a165113-1848-4c2b-9e1d-16aa48ac9765/resourceGroups/northwind-vb/providers/Microsoft.OperationalInsights/workspaces/NW-LA-Demo"
            ],
            "typeSettings": {
              "additionalResourceOptions": []
            },
            "queryType": 1,
            "resourceType": "microsoft.resourcegraph/resources"
          },
          {
            "id": "d2345891-fe3f-4dbd-8973-ec31877d6540",
            "version": "KqlParameterItem/1.0",
            "name": "TimeRange",
            "type": 4,
            "value": {
              "durationMs": 604800000
            },
            "typeSettings": {
              "selectableValues": [
                {
                  "durationMs": 3600000
                },
                {
                  "durationMs": 14400000
                },
                {
                  "durationMs": 43200000
                },
                {
                  "durationMs": 86400000
                },
                {
                  "durationMs": 172800000
                },
                {
                  "durationMs": 259200000
                },
                {
                  "durationMs": 604800000
                },
                {
                  "durationMs": 1209600000
                },
                {
                  "durationMs": 2419200000
                },
                {
                  "durationMs": 2592000000
                },
                {
                  "durationMs": 5184000000
                },
                {
                  "durationMs": 7776000000
                }
              ]
            },
            "label": "Time Range",
            "resourceType": "microsoft.insights/components"
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 4"
    },
    {
      "type": 1,
      "content": {
        "json": "This report relies on assessment data from Azure Security Center with ATP intergation enabled, Azure Sentinel, Azure Policy and Azure Monitor. The Azure Monitor output relies on the following solutions:\r\n\r\n<ul>\r\n<li>Update Management (In Azure Automation)</li>\r\n<li>Anti-Malware assessment</li>\r\n</ul>"
      },
      "name": "text - 1",
      "styleSettings": {
        "margin": "0",
        "padding": "2",
        "showBorder": true
      }
    },
    {
      "type": 11,
      "content": {
        "version": "LinkItem/1.0",
        "style": "tabs",
        "links": [
          {
            "cellValue": "selectedTab",
            "linkTarget": "parameter",
            "linkLabel": "Security Overview",
            "subTarget": "SecurityOverview",
            "style": "link"
          },
          {
            "cellValue": "selectedTab",
            "linkTarget": "parameter",
            "linkLabel": "Update and Protection Status",
            "subTarget": "UpdateStatus",
            "style": "link"
          },
          {
            "cellValue": "selectedTab",
            "linkTarget": "parameter",
            "linkLabel": "Azure Activity Log",
            "subTarget": "ActivityLog",
            "style": "link"
          },
          {
            "cellValue": "selectedTab",
            "linkTarget": "parameter",
            "linkLabel": "Key Vault",
            "subTarget": "KeyVault",
            "style": "link"
          }
        ]
      },
      "name": "links - 15"
    },
    {
      "type": 1,
      "content": {
        "json": "<H2>Security Overview</H2>"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "text - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityAlert\r\n| summarize Count = count() by AlertSeverity, ProductName\r\n| join kind = inner (SecurityAlert\r\n | make-series Trend = count() default = 0 on TimeGenerated from {TimeRange:start} to {TimeRange:end} step {TimeRange:grain} by AlertSeverity)\r\n on AlertSeverity\r\n | project-away TimeGenerated\r\n| extend AlertSeveritys = AlertSeverity\r\n| union (\r\n SecurityAlert \r\n | summarize Count = count() \r\n | extend jkey = 1\r\n | join kind=inner (SecurityAlert\r\n | make-series Trend = count() default = 0 on TimeGenerated from {TimeRange:start} to {TimeRange:end} step {TimeRange:grain}\r\n | extend jkey = 1) on jkey\r\n | extend AlertSeverity = 'All', AlertSeveritys = '*' \r\n)\r\n| extend Severity = iif(AlertSeverity == \"All\", 0,iif(AlertSeverity == \"High\", 1, iif(AlertSeverity == \"Medium\", 2, iif(AlertSeverity == \"Low\", 3, 4))))\r\n| order by ProductName asc, Severity asc\r\n",
        "size": 4,
        "title": "Security Alerts by Severity",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "AlertSeverity",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "subtitleContent": {
            "columnMatch": "ProductName",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "leftContent": {
            "columnMatch": "Count",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "style": "decimal",
                "useGrouping": false,
                "maximumFractionDigits": 2,
                "maximumSignificantDigits": 3
              }
            }
          },
          "secondaryContent": {
            "columnMatch": "Trend",
            "formatter": 9,
            "formatOptions": {
              "palette": "gray",
              "showIcon": true
            }
          },
          "showBorder": false
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "securityeventsbysev"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityAlert \r\n| summarize count() by bin(TimeGenerated, 1h), AlertSeverity, ProductName\r\n| order by TimeGenerated asc",
        "size": 0,
        "aggregation": 3,
        "title": "Security Alerts Trend",
        "noDataMessage": "No Security Alerts in Sentinel in this time range",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "linechart",
        "chartSettings": {
          "seriesLabelSettings": [
            {
              "seriesName": "Medium",
              "color": "orange"
            },
            {
              "seriesName": "Low",
              "color": "yellow"
            },
            {
              "seriesName": "High",
              "color": "redBright"
            },
            {
              "seriesName": "Informational",
              "color": "gray"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "SecurityAlertTrend"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityAlert \r\n| summarize count() by AlertName, AlertSeverity, ProductName",
        "size": 0,
        "title": "Security Alerts",
        "noDataMessage": "No Active Incidents in Sentinel",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "$gen_group",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "AlertName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "AlertSeverity",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "ProductName",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "count_",
              "formatter": 4,
              "formatOptions": {
                "palette": "coldHot",
                "showIcon": true
              }
            }
          ],
          "hierarchySettings": {
            "treeType": 1,
            "groupBy": [
              "ProductName"
            ],
            "expandTopLevel": true
          },
          "labelSettings": [
            {
              "columnId": "AlertName",
              "label": "Alert Name"
            },
            {
              "columnId": "AlertSeverity",
              "label": "Severity"
            },
            {
              "columnId": "count_",
              "label": "Number of Alerts"
            }
          ]
        },
        "sortBy": []
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "SecurityAlert"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityRecommendation\r\n| where RecommendationState == \"Unhealthy\"\r\n| summarize count() by RecommendationSeverity, RecommendationState\r\n| extend SortOrder = iff(RecommendationSeverity==\"High\", 3, iff(RecommendationSeverity==\"Medium\", 2, iif(RecommendationSeverity==\"Low\", 1, 0)))\r\n| order by SortOrder desc ",
        "size": 4,
        "title": "Security Recommendation Summary",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            }
          },
          "secondaryContent": {
            "columnMatch": "SortOrder",
            "formatter": 11,
            "formatOptions": {
              "showIcon": true
            }
          },
          "showBorder": false
        },
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "RecommendationSeverity",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "centerContent": {
            "columnMatch": "count_",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "maximumSignificantDigits": 3,
                "maximumFractionDigits": 2
              }
            }
          },
          "bottomContent": {
            "columnMatch": "RecommendationState",
            "formatOptions": {
              "showIcon": true
            }
          },
          "nodeIdField": "RecommendationState",
          "edgeLabel": "RecommendationState",
          "nodeSize": null,
          "staticNodeSize": 100,
          "colorSettings": {
            "nodeColorField": "SortOrder",
            "type": 4,
            "heatmapPalette": "hotCold",
            "heatmapMin": null,
            "heatmapMax": null
          },
          "groupByField": "RecommendationState",
          "hivesMargin": 5
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "securityrecommendationcount"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityRecommendation \r\n| where RecommendationDisplayName != \"\"\r\n| summarize count() by RecommendationDisplayName, RecommendationState \r\n| order by RecommendationState desc, count_ desc",
        "size": 0,
        "title": "Security Recommendation Result",
        "noDataMessage": "Security Baseline Recommendations from ASC",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "RecommendationDisplayName",
              "formatter": 7,
              "formatOptions": {
                "linkTarget": "WorkbookTemplate",
                "showIcon": true,
                "workbookContext": null
              }
            },
            {
              "columnMatch": "RecommendationState",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "count_",
              "formatter": 4,
              "formatOptions": {
                "palette": "coldHot",
                "showIcon": true
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "RecommendationDisplayName",
              "label": "Recommendation"
            },
            {
              "columnId": "RecommendationState",
              "label": "State"
            },
            {
              "columnId": "count_",
              "label": "Number of results"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "ASCBaseLineRecommendations"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityEvent\r\n| summarize Count=count() by Type, bin(TimeGenerated, 6h)\r\n| order by TimeGenerated asc",
        "size": 0,
        "title": "Security Event Anomalies",
        "noDataMessage": "No Security Events in this time range in Azure Sentinel",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "linechart"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "SecurityEventTrend"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SecurityDetection\r\n| summarize by Computer, AlertTitle, Description, SourceSystem",
        "size": 0,
        "title": "Threat Detections",
        "noDataMessage": "No threats detected or ATP not configured",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "AlertTitle",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "Description",
              "formatter": 1,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "SourceSystem",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "SecurityOverview"
      },
      "name": "ThreatDetection"
    },
    {
      "type": 1,
      "content": {
        "json": "<h2>Update and Protection Status</h2>"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "UpdateStatus"
      },
      "name": "text - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "ProtectionStatus\r\n| summarize (TimeGenerated, TypeofProtection) = argmax(TimeGenerated, TypeofProtection) by Computer\r\n| summarize ComputersCount=count(Computer) by TypeofProtection\r\n| sort by ComputersCount desc",
        "size": 0,
        "title": "Antimalware Protection Status",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "piechart"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "UpdateStatus"
      },
      "customWidth": "50",
      "name": "AntiMalwareProtection"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "ProtectionStatus\r\n| summarize (TimeGenerated, TypeofProtection) = argmax(TimeGenerated, TypeofProtection) by Computer\r\n| project Computer, TypeofProtection \r\n| sort by TypeofProtection desc, Computer asc",
        "size": 0,
        "showAnalytics": true,
        "title": "Antimalware Protection Status",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ]
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "UpdateStatus"
      },
      "customWidth": "50",
      "name": "AntiMalwareProtectionDetail"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "Update | where TimeGenerated>ago(14h) and OSType!=\"Linux\" and (Optional==false or Classification has \"Critical\" or Classification has \"Security\") and PublishedDate < ago(7d) | summarize hint.strategy=partitioned arg_max(TimeGenerated, UpdateState, Classification, Approved) by Computer, SourceComputerId, UpdateID | where UpdateState=~\"Needed\" and Approved!=false | summarize count() by Classification",
        "size": 0,
        "title": "Windows Update Compliance",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "piechart"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "UpdateStatus"
      },
      "customWidth": "50",
      "name": "UpdateCompliance"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "Update | where TimeGenerated>ago(14h) and OSType!=\"Linux\" and (Optional==false or Classification has \"Critical\" or Classification has \"Security\") and PublishedDate < ago(7d) | summarize hint.strategy=partitioned arg_max(TimeGenerated, UpdateState, Classification, Approved) by Computer, SourceComputerId, UpdateID | where UpdateState=~\"Needed\" and Approved!=false | summarize count() by Computer",
        "size": 0,
        "title": "Windows Update Compliance Summary",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "Computer",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "count_",
              "formatter": 4,
              "formatOptions": {
                "palette": "coldHot",
                "showIcon": true
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "Computer"
            },
            {
              "columnId": "count_",
              "label": "Missing updates"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "UpdateStatus"
      },
      "customWidth": "50",
      "name": "UpdateComplianceDetail"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity\r\n| where TimeGenerated > ago(7d)\r\n| summarize count() by Level",
        "size": 4,
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "tiles",
        "tileSettings": {
          "titleContent": {
            "columnMatch": "Level",
            "formatter": 1,
            "formatOptions": {
              "showIcon": true
            }
          },
          "leftContent": {
            "columnMatch": "count_",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            },
            "numberFormat": {
              "unit": 17,
              "options": {
                "style": "decimal",
                "useGrouping": false,
                "maximumFractionDigits": 2,
                "maximumSignificantDigits": 3
              }
            }
          },
          "rightContent": {
            "columnMatch": "Level",
            "formatter": 18,
            "formatOptions": {
              "showIcon": true,
              "thresholdsOptions": "icons",
              "thresholdsGrid": [
                {
                  "operator": "==",
                  "thresholdValue": "Error",
                  "representation": "3",
                  "text": ""
                },
                {
                  "operator": "==",
                  "thresholdValue": "Warning",
                  "representation": "2",
                  "text": ""
                },
                {
                  "operator": "==",
                  "thresholdValue": "Critical",
                  "representation": "4",
                  "text": ""
                },
                {
                  "operator": "Default",
                  "thresholdValue": null,
                  "representation": "1",
                  "text": ""
                }
              ]
            }
          },
          "showBorder": false
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "name": "ActivityLogSummary"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity\r\n| make-series Count = count() default = 0 on TimeGenerated from {TimeRange:start} to {TimeRange:end} step {TimeRange:grain}",
        "size": 1,
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "areachart"
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "name": "query - 17"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity\r\n| summarize deletions = countif(OperationName contains \"Delete\"), creations = countif(OperationName contains \"Create\"), updates = countif(OperationName contains \"Update\"), Activities = count(OperationName) by bin_at(TimeGenerated, 1h, now())",
        "size": 0,
        "title": "Activities over Time",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "linechart",
        "chartSettings": {
          "seriesLabelSettings": [
            {
              "seriesName": "deletions",
              "label": "Deletions",
              "color": "redBright"
            },
            {
              "seriesName": "creations",
              "label": "Creations",
              "color": "turquoise"
            },
            {
              "seriesName": "updates",
              "label": "Updates",
              "color": "orange"
            },
            {
              "seriesName": "Activities",
              "label": "Activities",
              "color": "purple"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "name": "activitylogovertime"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity\r\n| summarize dcount(ResourceProvider)",
        "size": 1,
        "title": "Resource providers producing activity logs",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "visualization": "graph",
        "tileSettings": {
          "titleContent": {
            "formatOptions": {
              "showIcon": true
            }
          },
          "leftContent": {
            "columnMatch": "dcount_ResourceProvider",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            }
          },
          "showBorder": false
        },
        "graphSettings": {
          "type": 2,
          "topContent": {
            "formatOptions": {
              "showIcon": true
            }
          },
          "centerContent": {
            "columnMatch": "dcount_ResourceProvider",
            "formatter": 12,
            "formatOptions": {
              "showIcon": true
            }
          },
          "nodeIdField": "dcount_ResourceProvider",
          "nodeSize": null,
          "staticNodeSize": 100,
          "colorSettings": {
            "nodeColorField": "dcount_ResourceProvider",
            "type": 4,
            "heatmapPalette": "coldHot",
            "heatmapMin": null,
            "heatmapMax": null
          },
          "hivesMargin": 5
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "customWidth": "30",
      "name": "query - 20"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity\r\n| summarize AggregatedValue = count() by ResourceProvider\r\n| order by AggregatedValue desc nulls last \r\n| take 10",
        "size": 0,
        "title": "Top 10 Resource Providers",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "exportToExcelOptions": "all",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "ResourceProvider",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "AggregatedValue",
              "formatter": 4,
              "formatOptions": {
                "showIcon": true
              }
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "customWidth": "60",
      "name": "query - 21"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureActivity  \r\n| where ActivityStatus == \"Failed\"\r\n| extend action_ = tostring(parse_json(Authorization).action) \r\n| extend code_ = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).statusMessage)).error)).code) \r\n| extend message_ = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).statusMessage)).error)).message) \r\n| project TimeGenerated, CallerIpAddress, CategoryValue, action_, code_, message_, OperationNameValue, ResourceProviderValue, ActivitySubstatus ",
        "size": 0,
        "title": "Failures in Activity Log",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "showExportToExcel": true,
        "exportToExcelOptions": "all",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "filter": true
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "ActivityLog"
      },
      "name": "query - 24"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureDiagnostics\r\n| where ResourceProvider ==\"MICROSOFT.KEYVAULT\" \r\n| summarize count() by bin(TimeGenerated, 1h), OperationName // Aggregate by hour\r\n| render timechart",
        "size": 0,
        "title": "Keyvault Activity over time",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "chartSettings": {
          "seriesLabelSettings": [
            {
              "seriesName": "VaultGet",
              "label": "Vault Activities"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "KeyVault"
      },
      "name": "query - 22"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AzureDiagnostics\r\n| where ResourceProvider ==\"MICROSOFT.KEYVAULT\"\r\n| summarize count() by CallerIPAddress\r\n| order by count_ desc",
        "size": 0,
        "title": "Calls to Keyvault",
        "timeContext": {
          "durationMs": 0
        },
        "timeContextFromParameter": "TimeRange",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "crossComponentResources": [
          "{LogsWorkspaces}"
        ],
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "CallerIPAddress",
              "formatter": 0,
              "formatOptions": {
                "showIcon": true
              }
            },
            {
              "columnMatch": "count_",
              "formatter": 4,
              "formatOptions": {
                "showIcon": true
              }
            }
          ],
          "labelSettings": [
            {
              "columnId": "CallerIPAddress"
            },
            {
              "columnId": "count_",
              "label": "Calls"
            }
          ]
        }
      },
      "conditionalVisibility": {
        "parameterName": "selectedTab",
        "comparison": "isEqualTo",
        "value": "KeyVault"
      },
      "name": "query - 23"
    }
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}